import React from "react";
import { Col, Container, Row } from "react-bootstrap";

const Welcome = () => {
  return (
    <Container className="p-5">
      <Row>
        <h3>ברוכים הבאים למערכת לרישום בקשות הזמנת אורחים לבריכת מענית.</h3>
        <p>
          בהתאם לתקנון הבריכה, בשבתות החל מחודש יולי הזמנת אורחים לבריכה הינה ע"י רישום ואישור הזמנה
          מוקדמים בלבד. כדי לאפשר הנאה ותפעול מיטביים, הוגדרו כללים וקווים מנחים:
        </p>
      </Row>
      <Row>
        <h3>תפוסה</h3>
        <div>
          כמות האורחים מוגבלת לפי התנאים הבאים:
          <ul>
            <li>סה"כ 40 אורחים לכל היותר בכל זמן נתון</li>
            <li>עד 5 אורחים לבית אב</li>
          </ul>
        </div>
      </Row>
      <Row>
        <h3>משמרות</h3>
        <div>
          השבת מחולקת לשתי משמרות שכל אחת מוגבלת למקסימום 40 אורחים
          <ul>
            <li>10:00-14:00 משמרת בוקר</li>
            <li>14:00-18:00 משמרת אחר הצהריים</li>
          </ul>
          הזמנת אורחים הינה לאחת משתי משמרות אלה.
        </div>
      </Row>
      <Row>
        <h3>תעדוף בקשות</h3>
        <div>
          בקשות לשבת מסויימת שיוגשו עד צהרי יום חמישי הקודם לשבת המבוקשת יתועדפו לפי סדר הקריטריונים הבאים:
          <ul>
            <li>
              מספר אירוחי העבר בעונה לבית אב. כלומר, בית אב שאירח פחות פעמים יקבל עדיפות לעומת בית
              אב עם מספר גבוה יותר של אירוחי עבר.{" "}
            </li>
            <li>זמן ביצוע ההזמנה.</li>
          </ul>
        </div>
        <div>בקשות מאוחרות יותר יתועדפו לפי סדר הגשתן.</div>
      </Row>
      <Row>
        <h3>דגשים</h3>
        <div>
          <ul>
            <li>המארח נוכח תמיד עם האורחים בבריכה.</li>
            <li>המארח אחראי להתנהגות האורחים בהתאם לתקנות ולהנחיות המציל.</li>
          </ul>
        </div>
      </Row>
      <Row>
        <h3>קישורים</h3>
        <div>
          <ul>
            <li><a href="/request">בקשה להזמנת אורחים</a></li>
            <li><a href="/reservations">מצבת הבקשות</a></li>
            <li><a href="/contact">צור קשר</a></li>
            <li><a href="/">תקנון הבריכה המלא</a></li>
          </ul>
        </div>
      </Row>
    </Container>
  );
};

export default Welcome;
